<!-- placeholder-1 -->
```fish
tofu plan -chdir=adventures/02-building-cloudhaven/expert
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
+ module.north_market.google_sql_database_instance.ledger will be created
+ module.north_market.google_storage_bucket.vault will be created
+ module.scholars_district.google_sql_database_instance.ledger will be created
+ module.scholars_district.google_storage_bucket.vault will be created
+ module.south_bazaar.google_sql_database_instance.ledger will be created
+ module.south_bazaar.google_storage_bucket.vault will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 6 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @gsigmund at 2026-01-31T13:56:01Z [(view log)](https://github.com/gsigmund/open-ecosystem-challenges/actions/runs/21545520494/job/62086285927#step::1).
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.north_market.google_sql_database_instance.ledger will be created
  + resource "google_sql_database_instance" "ledger" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "cloudhaven-north-market-ledger"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "the-guardian-protocols"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west1"
      + replica_names                  = (known after apply)
      + root_password_wo               = (write-only attribute)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + replication_cluster (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "REGIONAL"
          + connector_enforcement       = (known after apply)
          + deletion_protection_enabled = false
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 20
          + disk_type                   = "PD_SSD"
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-f1-micro"
          + user_labels                 = {
              + "district"   = "north-market"
              + "managed-by" = "opentofu"
              + "purpose"    = "merchant-ledger"
            }
          + version                     = (known after apply)

          + backup_configuration {
              + backup_tier                    = (known after apply)
              + enabled                        = true
              + point_in_time_recovery_enabled = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + connection_pool_config (known after apply)

          + data_cache_config (known after apply)

          + insights_config {
              + query_insights_enabled  = true
              + query_plans_per_minute  = 5
              + query_string_length     = 1024
              + record_application_tags = true
              + record_client_address   = true
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/cloudhaven/global/networks/default"
              + server_ca_mode  = (known after apply)
              + ssl_mode        = "ENCRYPTED_ONLY"
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 4
              + update_track = "stable"
            }

          + read_pool_auto_scale_config (known after apply)
        }
    }

  # module.north_market.google_storage_bucket.vault will be created
  + resource "google_storage_bucket" "vault" {
      + effective_labels            = {
          + "district"                   = "north-market"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "opentofu"
          + "purpose"                    = "merchant-storage"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "district"   = "north-market"
          + "managed-by" = "opentofu"
          + "purpose"    = "merchant-storage"
        }
      + location                    = "EU"
      + name                        = "cloudhaven-north-market-vault"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "district"                   = "north-market"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "opentofu"
          + "purpose"                    = "merchant-storage"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "NEARLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 90
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 3
              + with_state            = "ARCHIVED"
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.scholars_district.google_sql_database_instance.ledger will be created
  + resource "google_sql_database_instance" "ledger" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "cloudhaven-scholars-district-ledger"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "the-guardian-protocols"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west1"
      + replica_names                  = (known after apply)
      + root_password_wo               = (write-only attribute)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + replication_cluster (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "REGIONAL"
          + connector_enforcement       = (known after apply)
          + deletion_protection_enabled = false
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 50
          + disk_type                   = "PD_SSD"
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-g1-small"
          + user_labels                 = {
              + "district"   = "scholars-district"
              + "managed-by" = "opentofu"
              + "purpose"    = "merchant-ledger"
            }
          + version                     = (known after apply)

          + backup_configuration {
              + backup_tier                    = (known after apply)
              + enabled                        = true
              + point_in_time_recovery_enabled = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + connection_pool_config (known after apply)

          + data_cache_config (known after apply)

          + insights_config {
              + query_insights_enabled  = true
              + query_plans_per_minute  = 5
              + query_string_length     = 1024
              + record_application_tags = true
              + record_client_address   = true
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/cloudhaven/global/networks/default"
              + server_ca_mode  = (known after apply)
              + ssl_mode        = "ENCRYPTED_ONLY"
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 4
              + update_track = "stable"
            }

          + read_pool_auto_scale_config (known after apply)
        }
    }

  # module.scholars_district.google_storage_bucket.vault will be created
  + resource "google_storage_bucket" "vault" {
      + effective_labels            = {
          + "district"                   = "scholars-district"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "opentofu"
          + "purpose"                    = "merchant-storage"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "district"   = "scholars-district"
          + "managed-by" = "opentofu"
          + "purpose"    = "merchant-storage"
        }
      + location                    = "EU"
      + name                        = "cloudhaven-scholars-district-vault"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "district"                   = "scholars-district"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "opentofu"
          + "purpose"                    = "merchant-storage"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "NEARLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 90
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 3
              + with_state            = "ARCHIVED"
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.south_bazaar.google_sql_database_instance.ledger will be created
  + resource "google_sql_database_instance" "ledger" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "cloudhaven-south-bazaar-ledger"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "the-guardian-protocols"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west1"
      + replica_names                  = (known after apply)
      + root_password_wo               = (write-only attribute)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + replication_cluster (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "REGIONAL"
          + connector_enforcement       = (known after apply)
          + deletion_protection_enabled = false
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 10
          + disk_type                   = "PD_SSD"
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-f1-micro"
          + user_labels                 = {
              + "district"   = "south-bazaar"
              + "managed-by" = "opentofu"
              + "purpose"    = "merchant-ledger"
            }
          + version                     = (known after apply)

          + backup_configuration {
              + backup_tier                    = (known after apply)
              + enabled                        = true
              + point_in_time_recovery_enabled = true
              + start_time                     = "03:00"
              + transaction_log_retention_days = 7

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + connection_pool_config (known after apply)

          + data_cache_config (known after apply)

          + insights_config {
              + query_insights_enabled  = true
              + query_plans_per_minute  = 5
              + query_string_length     = 1024
              + record_application_tags = true
              + record_client_address   = true
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/cloudhaven/global/networks/default"
              + server_ca_mode  = (known after apply)
              + ssl_mode        = "ENCRYPTED_ONLY"
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day          = 7
              + hour         = 4
              + update_track = "stable"
            }

          + read_pool_auto_scale_config (known after apply)
        }
    }

  # module.south_bazaar.google_storage_bucket.vault will be created
  + resource "google_storage_bucket" "vault" {
      + effective_labels            = {
          + "district"                   = "south-bazaar"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "opentofu"
          + "purpose"                    = "merchant-storage"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "district"   = "south-bazaar"
          + "managed-by" = "opentofu"
          + "purpose"    = "merchant-storage"
        }
      + location                    = "EU"
      + name                        = "cloudhaven-south-bazaar-vault"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "NEARLINE"
      + terraform_labels            = {
          + "district"                   = "south-bazaar"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "opentofu"
          + "purpose"                    = "merchant-storage"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "NEARLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 90
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 3
              + with_state            = "ARCHIVED"
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + districts = {
      + north-market      = {
          + ledger = {
              + connection_name  = (known after apply)
              + database_version = "POSTGRES_15"
              + disk_size        = 20
            }
          + vault  = {
              + location = "EU"
              + name     = "cloudhaven-north-market-vault"
              + url      = (known after apply)
            }
        }
      + scholars-district = {
          + ledger = {
              + connection_name  = (known after apply)
              + database_version = "POSTGRES_15"
              + disk_size        = 50
            }
          + vault  = {
              + location = "EU"
              + name     = "cloudhaven-scholars-district-vault"
              + url      = (known after apply)
            }
        }
      + south-bazaar      = {
          + ledger = {
              + connection_name  = (known after apply)
              + database_version = "POSTGRES_15"
              + disk_size        = 10
            }
          + vault  = {
              + location = "EU"
              + name     = "cloudhaven-south-bazaar-vault"
              + url      = (known after apply)
            }
        }
    }
```
</details>
<!-- placeholder-5 -->
<!-- tofu-5-b3a7e2e0b478e879fcca30a927c1afe0.tfplan -->
<!-- placeholder-6 -->